software/dyn_openfoam_paraview/simulation/mixerVessel2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    rotor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       5952;
    }
    stator
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       6144;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3072;
        startFace       6336;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3072;
        startFace       9408;
    }
)

// ************************************************************************* //
